Тест/Тест/src/AccumulationRegisters/РегистрНакопления1/РегистрНакопления1.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РегистрНакопления1</name>
  <resources>
    <name>Колво</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>машина</name>
    <type>
      <types>CatalogRef.Машины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>индкод</name>
    <type>
      <types>CatalogRef.ИндКод</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Тест/Тест/src/InformationRegisters/ИндНомер/ИндНомер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИндНомер</name>
  <resources>
    <name>Код</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>наценка</name>
    <type>
      <types>CatalogRef.Коофициенты</types>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>цп</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>дн</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>п</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>АвитоЧастник</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоНовыйИндКод</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Стеллаж</name>
    <type>
      <types>CatalogRef.Стеллаж</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаПроверена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.МоделиАвтомобилей</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияКонвеера</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьФото</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.Состояние</types>
    </type>
  </attributes>
  <attributes>
    <name>Поддон</name>
    <type>
      <types>CatalogRef.Поддоны</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураДляПоиска</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подкатегория</name>
    <type>
      <types>CatalogRef.Категории</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючевыеСлова</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНаличия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактНаличия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаНаличие</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Машина</name>
    <type>
      <types>CatalogRef.Машины</types>
    </type>
  </attributes>
  <attributes>
    <name>ДетальКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Оценка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроверкиЕстьВНаличии</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЕстьВНаличии</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВАвтозагрузкеАвито</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>индкод</name>
    <type>
      <types>CatalogRef.ИндКод</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест/Тест/src/CommonModules/ВсеСинхронизацииПродажиИЗаявки/Module.bsl
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// Продажа МодульФормы
//&НаСервереБезКонтекста // Процедура вызывается из ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
Процедура СинхронизоватьВыданСЗаказомКлиента(СсылкаЗаказКлиента,НомерПродажа) ЭКСПОРТ
	
	Если НЕ ЗначениеЗаполнено(СсылкаЗаказКлиента) тогда 
		Возврат;
	Конецесли; 	

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПродажаЗапчастейТаблица.НомерСтроки,
		|	ПродажаЗапчастейТаблица.Ссылка,
		|	ПродажаЗапчастейТаблица.Товар,
		|	ПродажаЗапчастейТаблица.Количество,
		|	ПродажаЗапчастейТаблица.Цена,
		|	ПродажаЗапчастейТаблица.Скидка,
		|	ПродажаЗапчастейТаблица.Партия,
		|	ПродажаЗапчастейТаблица.машина,
		|	ПродажаЗапчастейТаблица.цена1,
		|	ПродажаЗапчастейТаблица.Комментарий,
		|	ПродажаЗапчастейТаблица.Сумма,
		|	ПродажаЗапчастейТаблица.ПродНак,
		|	ПродажаЗапчастейТаблица.укод,
		|	ПродажаЗапчастейТаблица.Отменено,
		|	ПродажаЗапчастейТаблица.Склад,
		|	ПродажаЗапчастейТаблица.СуммаНДС,
		|	ПродажаЗапчастейТаблица.СтатусТовара,
		|	ПродажаЗапчастейТаблица.ДатаОтгрузкиСоСклада,
		|	ПродажаЗапчастейТаблица.Сборщик,
		|	ПродажаЗапчастейТаблица.ДатаВыдачи,
		|	ПродажаЗапчастейТаблица.ОтветственныйЗаВыдачу,
		|	ПродажаЗапчастейТаблица.Корректировка,
		|	ПродажаЗапчастейТаблица.МестоХранения,
		|	ПродажаЗапчастейТаблица.Заменить
		|ИЗ
		|	Документ.ПродажаЗапчастей.Таблица КАК ПродажаЗапчастейТаблица
		|ГДЕ
		|	
		|	ПродажаЗапчастейТаблица.Ссылка.Номер = &Номер";
	
	Запрос.УстановитьПараметр("Номер",НомерПродажа);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если  РезультатЗапроса.Пустой() ТОгда 
		Возврат; 
	КонецЕСли ;
	
	Попытка
	ОбъектЗаказКлиента = СсылкаЗаказКлиента.ПолучитьОбъект(); 
	ОбъектЗаказКлиента.Товары.Очистить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ОбъектЗаказКлиента.Товары.Добавить();
		НоваяСтрока.Номенклатура = Выборка.Товар;
		НоваяСтрока.Партия 		= Выборка.Партия;
		НоваяСтрока.Выдан 		= Выборка.СтатусТовара;
		НоваяСтрока.Количество 	= Выборка.Количество;
		НоваяСтрока.Цена 		= Выборка.Цена;
		НоваяСтрока.Сумма 		= Выборка.Сумма;
		НоваяСтрока.Отменено	= Выборка.Отменено; 
		НоваяСтрока.ОтветственныйЗаВыдачу 	= Выборка.ОтветственныйЗаВыдачу; 
		НоваяСтрока.ДатаВыдачи				= Выборка.ДатаВыдачи;
		НоваяСтрока.Заменить				= Выборка.Заменить; 
	КонецЦикла;
	
// ----------------------------------------------------------------------------------------------------------------
	
	ОбъектЗаказКлиента.Записать();	
	Исключение
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Ошибка!!! не получилось синхронизовать заявку. Пишите в тех поддержку! Код Ошибки: 014553"; 
		Сообщение.Сообщить();
		
	КонецПопытки; 
КонецПроцедуры
//----------------------------------------------------------------------------------------------------------------------

//ЗааказКлиента МодульФормы ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

// ОбновитьПродажуТЧ +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

Процедура ОбновитьПродажуТЧ(ТоварыЗаявки,СсылкаПродажа) Экспорт
	Попытка
	Заблокирована = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаПродажа, "Заблокирована");
	Если Не Заблокирована Тогда
		ОбъектПродажа = СсылкаПродажа.ПолучитьОбъект();
		НаборЗаписей=РегистрыНакопления.РегистрНакопления1.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить (СсылкаПродажа);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать();   
	
		ОбъектПродажа.Таблица.Очистить();
		Для Каждого СтрокаТЧЗаявки Из ТоварыЗаявки Цикл
			НоваяСтрока = ОбъектПродажа.Таблица.Добавить();
			НоваяСтрока.Партия = СтрокаТЧЗаявки.Партия;
			НоваяСтрока.Товар = СтрокаТЧЗаявки.Номенклатура;
			Если ЗначениеЗаполнено(СтрокаТЧЗаявки.Партия) Тогда
				Структура = ПолучитьСкладПоПартии(СтрокаТЧЗаявки.Партия);
				НоваяСтрока.Склад = Структура.Склад;
				НоваяСтрока.машина = Структура.Машина;
			Иначе
				НоваяСтрока.Склад = Справочники.Склады.НайтиПоКоду("000000002");
			КонецЕсли;
			НоваяСтрока.МестоХранения = ПолучитьАдрес(СтрокаТЧЗаявки.Номенклатура, НоваяСтрока.Склад,СтрокаТЧЗаявки.Партия);
			НоваяСтрока.Количество = СтрокаТЧЗаявки.Количество;
			НоваяСтрока.Цена = СтрокаТЧЗаявки.Цена;
			НоваяСтрока.СуммаНДС = СтрокаТЧЗаявки.СуммаНДС;
			НоваяСтрока.Сумма = СтрокаТЧЗаявки.Сумма;
			НоваяСтрока.СтатусТовара = СтрокаТЧЗаявки.Выдан;
			НоваяСтрока.Отменено = СтрокаТЧЗаявки.Отменено; 
			НоваяСтрока.ДатаВыдачи = СтрокаТЧЗаявки.ДатаВыдачи; 
			НоваяСтрока.ОтветственныйЗаВыдачу = СтрокаТЧЗаявки.ОтветственныйЗаВыдачу; 
			НоваяСтрока.Заменить = СтрокаТЧЗаявки.Заменить; 
		КонецЦикла;
		ОбъектПродажа.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	Исключение
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Ошибка!!! не получилось синхронизовать продажу. Пишите в тех поддержку! Код Ошибки: 034344"; 
	КонецПопытки; 
	
КонецПроцедуры

Функция ПолучитьСкладПоПартии(индкод)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РегистрНакопления1Остатки.Товар КАК Товар,
	|	РегистрНакопления1Остатки.индкод КАК индкод,
	|	РегистрНакопления1Остатки.Склад КАК Склад,
	|	РегистрНакопления1Остатки.машина КАК машина
	|ИЗ
	|	РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
	|ГДЕ
	|	РегистрНакопления1Остатки.индкод = &индкод";

	Запрос.УстановитьПараметр("индкод", индкод);

	РезультатЗапроса = Запрос.Выполнить().Выбрать();

	РезультатЗапроса.Следующий();
    Структура = НОвый Структура; 
	Структура.Вставить("Склад",РезультатЗапроса.Склад);
	Структура.Вставить("Машина",РезультатЗапроса.машина);
	Возврат Структура;

КонецФункции

Функция ПолучитьАдрес(Номенклатура, Склад, ИндКод)
	Запрос  = Новый запрос;
	Запрос.текст = "ВЫБРАТЬ
				   |	дт_МестаХраненияНоменклатурыСрезПоследних.МестоХранения КАК МестоХранения,
				   |	ЕСТЬNULL(Стеллажик.ГруппаМестХранения, ЗНАЧЕНИЕ(Справочник.ГруппыМестХранения.ПустаяСсылка)) КАК ГруппаМестХранения,
				   |	ВЫБОР
				   |		КОГДА ИндНомер.Стеллаж <> ЗНАЧЕНИЕ(Справочник.стеллаж.пустаяссылка)
				   |			ТОГДА ИндНомер.Стеллаж
				   |		ИНАЧЕ Стеллажик.Ссылка
				   |	КОНЕЦ КАК Стеллаж
				   |ИЗ
				   |	РегистрСведений.дт_МестаХраненияНоменклатуры.СрезПоследних(
				   |			&ДатаСреза,
				   |			Склад = &Склад
				   |				И Номенклатура = &Номенклатура) КАК дт_МестаХраненияНоменклатурыСрезПоследних
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Стеллаж КАК Стеллажик
				   |		ПО дт_МестаХраненияНоменклатурыСрезПоследних.МестоХранения = Стеллажик.Ссылка
				   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИндНомер КАК ИндНомер
				   |		ПО дт_МестаХраненияНоменклатурыСрезПоследних.Номенклатура = ИндНомер.индкод.Владелец
				   |ГДЕ
				   |	ИндНомер.индкод = &индкод";

	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("индкод", ИндКод);
	Запрос.УстановитьПараметр("ДатаСреза", ТекущаяДата());

	Выборка = Запрос.Выполнить().Выбрать();

	Если выборка.Количество() > 0 Тогда
		Выборка.Следующий();
		Возврат Выборка.стеллаж;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции
// ---------------------------------------------------------------------------------------------------------------------

// ++++ Получить текущий этап заявки 
Функция ПолучитьТекущийЭтапЗаявки(НомерЗаявки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказКлиента.ЭтапыПродажи
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	ЗаказКлиента.Ссылка.Номер = &Номер";
	
	Запрос.УстановитьПараметр("Номер", НомерЗаявки);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() тогда 		
		Возврат Неопределено;
	КонецЕсли; 
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Этап = Выборка.ЭтапыПродажи; 
		
Возврат Этап; 
КонецФункции 
// ----
